In [1]:
# Import sqlite3
import sqlite3

In [2]:
# How to connect with sqlite database

# create a connection to the database IMDB.sqlite in the current working directory, 
# implicitly creating it if it does not exist.

db=sqlite3.connect('IMDB.sqlite') # connect(pathOfDatabase)

In [4]:
# Create new database
db=sqlite3.connect('School.sqlite')
print(db)

<sqlite3.Connection object at 0x7fc931ecd2d0>

In [5]:
# In order to execute SQL statements and fetch results from SQL queries, we will need to use a database cursor. 
# Call db.cursor() to create the Cursor. db is connection object.
cur=db.cursor()

In [10]:
# How to execute a query

# This routine executes an SQL statement. The SQL statement may be parameterized 
# (i. e. placeholders instead of SQL literals). The sqlite3 module supports two kinds of placeholders: 
# question marks and named placeholders (named style).

# Syntax: cursor.execute(sql [, optional parameters])

sqlQuery='create table Student(RollNumber int Primary key, Name text, Age int)'
cur.execute(sqlQuery)

In [11]:
cur.execute('insert into Student values(101,"Aman",20)')

In [12]:
# To reflect all the queries in database we need to call commit()
db.commit() # db is connection object

In [14]:
cur.execute('insert into Student values(102,"Amit",21)')
db.commit()

In [15]:
# Close the connection
db.close()

In [6]:
cur.execute('insert into Student values(103,"Mohit",24)')
db.commit()

In [7]:
# Passing parameter in sql query
rollNumber=104
Name="Nikhil"
Age=34
cur.execute('insert into Student values(?,?,?)',(rollNumber,Name,Age))
db.commit()

In [8]:
# Add multiple rows in a table
values=[(105,"Nidhi",20),(106,"Manisha",21),(107,"Ankush",22)]
cur.executemany('insert into Student values(?,?,?)',values)
db.commit()

In [10]:
new_age=50
# Only in case of cur.execute() not in cur.executemany()
cur.execute('Update Student set Age=? where RollNumber=103',(new_age,))
db.commit()

In [11]:
# How to fetch result 
cur.execute('select * from Student') # After executing this we can iterate over cur to get data

for row in cur:
    print(row)

(101, 'Aman', 20)
(102, 'Amit', 21)
(103, 'Mohit', 50)
(104, 'Nikhil', 34)
(105, 'Nidhi', 20)
(106, 'Manisha', 21)
(107, 'Ankush', 22)

In [13]:
# fetchone(), fetchmany(), fetchall()

# fetchone() gives first row
cur.execute('select * from Student')
print(cur.fetchone()) # after this cur will points to second row
print(cur.fetchone())

(101, 'Aman', 20)
(102, 'Amit', 21)

In [14]:
# fetchmany(n) gives n rows
cur.execute('select * from Student')
print(cur.fetchmany(4))
# If we dont pass n then we will get only one row

[(101, 'Aman', 20), (102, 'Amit', 21), (103, 'Mohit', 50), (104, 'Nikhil', 34)]

In [16]:
# fetchall() gives all the rows
cur.execute('select * from Student')
print(cur.fetchall())

[(101, 'Aman', 20), (102, 'Amit', 21), (103, 'Mohit', 50), (104, 'Nikhil', 34), (105, 'Nidhi', 20), (106, 'Manisha', 21), (107, 'Ankush', 22)]

In [1]:
# sqlite + pandas

In [5]:
import sqlite3
import pandas as pd
db=sqlite3.connect('School.sqlite')

In [6]:
# data=pd.read_sql_query(queryString,connectionObject)
data=pd.read_sql_query('select * from Student',db)
print(data)
print(type(data))

   RollNumber     Name  Age
0         101     Aman   20
1         102     Amit   21
2         103    Mohit   50
3         104   Nikhil   34
4         105    Nidhi   20
5         106  Manisha   21
6         107   Ankush   22
<class 'pandas.core.frame.DataFrame'>

In [7]:
print(data[data['Age']>30])

   RollNumber    Name  Age
2         103   Mohit   50
3         104  Nikhil   34

In [8]:
# Create a data frame
data=pd.DataFrame([[201,"Aman","English",20000],[202,"Komal","Maths",22000],[203,"Mahesh","Science",23000]],
                 columns=["ID","Name","Course","Salary"])
print(data)

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   Komal    Maths   22000
2  203  Mahesh  Science   23000

In [9]:
# How to convert dataframe into sql table
data.to_sql("Faculty",db)

In [12]:
# Add column to Student table
data=pd.read_sql_query('select * from Student',db)
data["Address"]="Test"
data.to_sql('Student',db,if_exists="replace")
# This line will replace Student table if exists with dataframe named "data"